app/views/books/index.html.erb

      <%= link_to  book_favorites_path(book.id),  method: :delete do %>
      ❤️<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

      <%= link_to  book_favorites_path(book.id),  method: :post do %>
          ♡<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

 <%= link_to   book_bookcomments_path(book.id),  method: :delete do %>
        コメント数: <%= book.bookcomments.count %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "bookcomments" WHERE "bookcomments"."book_id" = ?  [["book_id", 1]]

 <%= link_to   book_bookcomments_path(book.id),  method: :post do %>
            コメント数: <%= book.bookcomments.count %>
---
SELECT COUNT(*) FROM "bookcomments" WHERE "bookcomments"."book_id" = ?  [["book_id", 2]]