app/views/books/show.html.erb

      <%= link_to  book_favorites_path(@book.id),  method: :delete do %>
      ❤️<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

      <%= link_to  book_favorites_path(@book.id),  method: :post do %>
          <%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 7]]


コメント数：<%= @book.bookcomments.count %>
---
SELECT "books".* FROM "books"
SELECT "bookcomments".* FROM "bookcomments"
SELECT COUNT(*) FROM "bookcomments" WHERE "bookcomments"."book_id" = ?  [["book_id", 8]]

  <%= link_to   book_bookcomments_path(@book.id),  method: :delete do %>
  コメント数: <%= @book.bookcomments.count %>
---
SELECT "bookcomments".* FROM "bookcomments" WHERE "bookcomments"."book_id" = ?  [["book_id", 2]]
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "bookcomments" WHERE "bookcomments"."book_id" = ?  [["book_id", 1]]

  <%= link_to   book_bookcomments_path(@book.id),  method: :post do %>
  コメント数: <%= @book.bookcomments.count %>
---
SELECT COUNT(*) FROM "bookcomments" WHERE "bookcomments"."book_id" = ?  [["book_id", 2]]