app/controllers/bookcomments_controller.rb

def create
	@book = Book.find(params[:book_id])
	@book_new = Book.new
	@bookcomment = @book.bookcomments.new(bookcomment_params)
	@bookcomment.user_id = current_user.id
	if @bookcomment.save
	flash[:success] = "Comment was successfully created."
      redirect_to book_path(@book)
    else
    	flash[:notice] = ' errors prohibited this obj from being saved:'
      @bookcomments = Bookcomment.where(book_id: @book.id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "bookcomments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", ""], ["user_id", 1], ["book_id", 8], ["created_at", "2020-01-30 06:05:16.152215"], ["updated_at", "2020-01-30 06:05:16.152215"]]
SELECT "bookcomments".* FROM "bookcomments" WHERE "bookcomments"."book_id" = ?  [["book_id", 8]]

 def destroy
    @bookcomment = Bookcomment.find(params[:book_id])
    if @bookcomment.user != current_user
      redirect_to request.referer
    end
    @bookcomment.destroy
---
SELECT  "bookcomments".* FROM "bookcomments" WHERE "bookcomments"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "bookcomments" WHERE "bookcomments"."id" = ?  [["id", 14]]