app/controllers/books_controller.rb

	def create
        @user = current_user
		@book = Book.new(book_params)
        @book.user_id = (current_user.id)
	    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ken"], ["body", "boydesu"], ["user_id", 1], ["created_at", "2019-12-26 12:01:19.967165"], ["updated_at", "2019-12-26 12:01:19.967165"]]

    def show
        @user = current_user
    	@book = Book.find(params[:id])
    	@book_new = Book.new
      @bookcomment =Bookcomment.new
      @bookcomments =Bookcomment.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bookcomments".* FROM "bookcomments" WHERE "bookcomments"."book_id" = ?  [["book_id", 5]]

    def index
        @user = current_user
        @books = Book.all
---
SELECT "books".* FROM "books"

     def  ensure_current_user
      @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]